[
    {
        "id" : "rlu1fjRhx9",
        "book name": "The 1619 Project: A New Origin Story",
        "link": "https://www.amazon.com/1619-Project-New-Origin-Story/dp/0593230574/ref=sr_1_18?qid=1644999019&sr=8-18&srs=17143709011",
        "author": "Nikole Hannah-Jones",
        "genre": "African American Demographic Studies (Books)",
        "image": "https://images-na.ssl-images-amazon.com/images/I/41Mv0v5FnQL._SX329_BO1,204,203,200_.jpg",
        "detail": [
            "In late August 1619, a ship arrived in the British colony of Virginia bearing a cargo of twenty to thirty enslaved people from Africa. Their arrival led to the barbaric and unprecedented system of American chattel slavery that would last for the next 250 years. This is sometimes referred to as the country’s original sin, but it is more than that: It is the source of so much that still defines the United States."
        ],
        "price": "$22.80"
    },
    {
        "id" : "t0lcrvIKG1",
        "book name": "Cloud Cuckoo Land: A Novel",
        "link": "https://www.amazon.com/Cloud-Cuckoo-Land-Anthony-Doerr-ebook/dp/B08TRMSR3Z/ref=sr_1_27?qid=1644999019&sr=8-27&srs=17143709011",
        "author": "Anthony Doerr",
        "genre": "Historical Literary Fiction",
        "image": "https://m.media-amazon.com/images/I/5184hNUzpgL.jpg",
        "detail": [
            "Thirteen-year-old Anna, an orphan, lives inside the formidable walls of Constantinople in a house of women who make their living embroidering the robes of priests. Restless, insatiably curious, Anna learns to read, and in this ancient city, famous for its libraries, she finds a book, the story of Aethon, who longs to be turned into a bird so that he can fly to a utopian paradise in the sky. This she reads to her ailing sister as the walls of the only place she has known are bombarded in the great siege of Constantinople. Outside the walls is Omeir, a village boy, miles from home, conscripted with his beloved oxen into the invading army. His path and Anna’s will cross."
        ],
        "price": "$15.99"
    },
    {
        "id" : "DG8rP79mR0",
        "book name": "The Last Thing He Told Me: A Novel",
        "link": "https://www.amazon.com/Last-Thing-He-Told-Me/dp/1501171348/ref=sr_1_12?qid=1644999016&sr=8-12&srs=17143709011",
        "author": "Laura Dave",
        "genre": "Family Life Fiction (Books)",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51aJ7twCu0L._SX327_BO1,204,203,200_.jpg",
        "detail": [
            "A ",
            "gripping",
            " (Entertainment Weekly) mystery about a woman who thinks she’s found the love of her life—until he disappears.\n\nBefore Owen Michaels disappears, he smuggles a note to his beloved wife of one year: Protect her. Despite her confusion and fear, Hannah Hall knows exactly to whom the note refers—Owen’s sixteen-year-old daughter, Bailey. Bailey, who lost her mother tragically as a child. Bailey, who wants absolutely nothing to do with her new stepmother.\n\nAs Hannah’s increasingly desperate calls to Owen go unanswered, as the FBI arrests Owen’s boss, as a US marshal and federal agents arrive at her Sausalito home unannounced, Hannah quickly realizes her husband isn’t who he said he was. And that Bailey just may hold the key to figuring out Owen’s true identity—and why he really disappeared.\n\nHannah and Bailey set out to discover the truth. But as they start putting together the pieces of Owen’s past, they soon realize they’re also building a new future—one neither of them could have anticipated.\n\nWith its breakneck pacing, dizzying plot twists, and evocative family drama, The Last Thing He Told Me is a riveting mystery, certain to shock you with its final, heartbreaking turn."
        ],
        "price": "$13.50"
    },
    {
        "id" : "spFHVNcx2c",
        "book name": "Reminders of Him: A Novel",
        "link": "https://www.amazon.com/Reminders-Him-Novel-Colleen-Hoover/dp/1542025605/ref=sr_1_7?qid=1644999016&sr=8-7&srs=17143709011",
        "author": "Colleen Hoover",
        "genre": "Mothers & Children Fiction",
        "image": "https://images-na.ssl-images-amazon.com/images/I/41n9-p6-PpL._SX331_BO1,204,203,200_.jpg",
        "detail": [
            "A troubled young mother yearns for a shot at redemption in this heartbreaking yet hopeful story from #1 New York Times bestselling author Colleen Hoover.\n\nAfter serving five years in prison for a tragic mistake, Kenna Rowan returns to the town where it all went wrong, hoping to reunite with her four-year-old daughter. But the bridges Kenna burned are proving impossible to rebuild. Everyone in her daughter’s life is determined to shut Kenna out, no matter how hard she works to prove herself.\n\nThe only person who hasn’t closed the door on her completely is Ledger Ward, a local bar owner and one of the few remaining links to Kenna’s daughter. But if anyone were to discover how Ledger is slowly becoming an important part of Kenna’s life, both would risk losing the trust of everyone important to them.\n\nThe two form a connection despite the pressure surrounding them, but as their romance grows, so does the risk. Kenna must find a way to absolve the mistakes of her past in order to build a future out of hope and healing."
        ],
        "price": "$11.95"
    },
    {
        "id" : "02gKjCe7Oi",
        "book name": "Dr. Seuss's Beginner Book Collection (Cat in the Hat, One Fish Two Fish, Green Eggs and Ham, Hop on Pop, Fox in Socks)",
        "link": "https://www.amazon.com/Seusss-Beginner-Collection-Green-Socks/dp/0375851569/ref=sr_1_15?qid=1644999016&sr=8-15&srs=17143709011",
        "author": "Dr. Seuss",
        "genre": "American Poetry (Books)",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51PWDGLykIL._SX339_BO1,204,203,200_.jpg",
        "detail": [
            "This collectible Dr. Seuss boxed set is perfect for inspiring a love of reading, and with five books in one super giftable set, it will complete any beginning reader's shelf!\n \nAn ideal gift for new parents, birthday celebrations, and happy occasions of all kinds, this collection of five beloved Beginner Books by Dr. Seuss will be cherished by young and old alike."
        ],
        "price": "$5.06"
    },
    {
        "id" : "jzub9psYrH",
        "book name": "People We Meet on Vacation",
        "link": "https://www.amazon.com/People-Meet-Vacation-Emily-Henry/dp/1984806750/ref=sr_1_40?qid=1644999099&sr=8-40&srs=17143709011",
        "author": "Emily Henry",
        "genre": "Romantic Comedy (Books)",
        "image": "https://images-na.ssl-images-amazon.com/images/I/41bUd1dC+VL._SX331_BO1,204,203,200_.jpg",
        "detail": [
            "Two best friends. Ten summer trips. One last chance to fall in love.\n\tPoppy and Alex. Alex and Poppy. They have nothing in common. She’s a wild child; he wears khakis. She has insatiable wanderlust; he prefers to stay home with a book. And somehow, ever since a fateful car share home from college many years ago, they are the very best of friends. For most of the year they live far apart—she’s in New York City, and he’s in their small hometown—but every summer, for a decade, they have taken one glorious week of vacation together.\n \nUntil two years ago, when they ruined everything. They haven't spoken since."
        ],
        "price": "$9.98"
    },
    {
        "id" : "aGULJU4c9g",
        "book name": "Wonder",
        "link": "https://www.amazon.com/Wonder-R-J-Palacio/dp/0375869026/ref=sr_1_33?qid=1644999099&sr=8-33&srs=17143709011",
        "author": "R. J. Palacio",
        "genre": "Children's Books on Disability",
        "image": "https://images-na.ssl-images-amazon.com/images/I/41VJT+TCLkL._SX342_BO1,204,203,200_.jpg",
        "detail": [
            "August Pullman was born with a facial difference that, up until now, has prevented him from going to a mainstream school. Starting 5th grade at Beecher Prep, he wants nothing more than to be treated as an ordinary kid—but his new classmates can’t get past Auggie’s extraordinary face. Beginning from Auggie’s point of view and expanding to include his classmates, his sister, her boyfriend, and others, the perspectives converge to form a portrait of one community’s struggle with empathy, compassion, and acceptance. In a world where bullying among young people is an epidemic, this is a refreshing new narrative full of heart and hope."
        ],
        "price": "$15.54"
    },
    {
        "id" : "AWRKhkMtgJ",
        "book name": "It Ends with Us: A Novel",
        "link": "https://www.amazon.com/Ends-Us-Novel-Colleen-Hoover/dp/1501110365/ref=sr_1_6?qid=1644999016&sr=8-6&srs=17143709011",
        "author": "Colleen Hoover",
        "genre": "American Literature (Books)",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51Zu0ZwT0jL._SX320_BO1,204,203,200_.jpg",
        "detail": [
            "Lily hasn’t always had it easy, but that’s never stopped her from working hard for the life she wants. She’s come a long way from the small town where she grew up—she graduated from college, moved to Boston, and started her own business. And when she feels a spark with a gorgeous neurosurgeon named Ryle Kincaid, everything in Lily’s life seems too good to be true.\n\nRyle is assertive, stubborn, maybe even a little arrogant. He’s also sensitive, brilliant, and has a total soft spot for Lily. And the way he looks in scrubs certainly doesn’t hurt. Lily can’t get him out of her head. But Ryle’s complete aversion to relationships is disturbing. Even as Lily finds herself becoming the exception to his ",
            "no dating",
            " rule, she can’t help but wonder what made him that way in the first place."
        ],
        "price": "$12.99"
    },
    {
        "id" : "N0gKm4lBIF",
        "book name": "Go Tell the Bees That I Am Gone: A Novel (Outlander Book 9)",
        "link": "https://www.amazon.com/Tell-Bees-That-Gone-Outlander-ebook/dp/B0925FP6G6/ref=sr_1_35?qid=1644999099&sr=8-35&srs=17143709011",
        "author": "Diana Gabaldon",
        "genre": "Time Travel Romance",
        "image": "https://m.media-amazon.com/images/I/516Kv9V2I2L.jpg",
        "detail": [
            "Jamie Fraser and Claire Randall were torn apart by the Jacobite Rising in 1746, and it took them twenty years to find each other again. Now the American Revolution threatens to do the same.\n \nIt is 1779 and Claire and Jamie are at last reunited with their daughter, Brianna, her husband, Roger, and their children on Fraser’s Ridge. Having the family together is a dream the Frasers had thought impossible.\n \nYet even in the North Carolina backcountry, the effects of war are being felt. Tensions in the Colonies are great and local feelings run hot enough to boil Hell’s teakettle. Jamie knows loyalties among his tenants are split and it won’t be long until the war is on his doorstep."
        ],
        "price": "$15.99"
    },
    {
        "id" : "Q9OyChgsVX",
        "book name": "Wish You Were Here: A Novel",
        "link": "https://www.amazon.com/Wish-You-Were-Here-Novel-ebook/dp/B0925DXNV1/ref=sr_1_19?qid=1644999019&sr=8-19&srs=17143709011",
        "author": "Jodi Picoult",
        "genre": "Women's Sagas",
        "image": "https://m.media-amazon.com/images/I/41ZctyF+11L.jpg",
        "detail": [
            "Diana O’Toole is perfectly on track. She will be married by thirty, done having kids by thirty-five, and move out to the New York City suburbs, all while climbing the professional ladder in the cutthroat art auction world. She’s an associate specialist at Sotheby’s now, but her boss has hinted at a promotion if she can close a deal with a high-profile client. She’s not engaged just yet, but she knows her boyfriend, Finn, a surgical resident, is about to propose on their romantic getaway to the Galápagos—days before her thirtieth birthday. Right on time.\n\nBut then a virus that felt worlds away has appeared in the city, and on the eve of their departure, Finn breaks the news: It’s all hands on deck at the hospital. He has to stay behind. You should still go, he assures her, since it would be a shame for all of their nonrefundable trip to go to waste. And so, reluctantly, she goes"
        ],
        "price": "$14.99"
    },
    {
        "id" : "5oyg7rMSh8",
        "book name": "The Lincoln Highway: A Novel",
        "link": "https://www.amazon.com/Lincoln-Highway-Novel-Amor-Towles-ebook/dp/B08WRH53MY/ref=sr_1_1?qid=1644999016&sr=8-1&srs=17143709011",
        "author": "Amor Towles",
        "genre": "Coming of Age Fiction (Books)",
        "image": "https://m.media-amazon.com/images/I/51wH91YObNL.jpg",
        "detail": [
            "In June, 1954, eighteen-year-old Emmett Watson is driven home to Nebraska by the warden of the juvenile work farm where he has just served fifteen months for involuntary manslaughter. His mother long gone, his father recently deceased, and the family farm foreclosed upon by the bank, Emmett's intention is to pick up his eight-year-old brother, Billy, and head to California where they can start their lives anew. But when the warden drives away, Emmett discovers that two friends from the work farm have hidden themselves in the trunk of the warden's car. Together, they have hatched an altogether different plan for Emmett's future, one that will take them all on a fateful journey in the opposite direction—to the City of New York.\n\nSpanning just ten days and told from multiple points of view, Towles's third novel will satisfy fans of his multi-layered literary styling while providing them an array of new and richly imagined settings, characters, and themes."
        ],
        "price": "$14.99"
    },
    {
        "id" : "M6PlPBK96A",
        "book name": "Black Cake: A Novel",
        "link": "https://www.amazon.com/Black-Cake-Novel-Charmaine-Wilkerson/dp/0593358333/ref=sr_1_41?qid=1644999099&sr=8-41&srs=17143709011",
        "author": "Charmaine Wilkerson",
        "genre": "Black & African American Historical Fiction (Books)",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51J20urYWyL._SX327_BO1,204,203,200_.jpg",
        "detail": [
            "In present-day California, Eleanor Bennett’s death leaves behind a puzzling inheritance for her two children, Byron and Benny: a traditional Caribbean black cake, made from a family recipe with a long history, and a voice recording. In her message, Eleanor shares a tumultuous story about a headstrong young swimmer who escapes her island home under suspicion of murder. The heartbreaking tale Eleanor unfolds, the secrets she still holds back, and the mystery of a long-lost child, challenge everything the siblings thought they knew about their lineage, and themselves.\n\nCan Byron and Benny reclaim their once-close relationship, piece together Eleanor’s true history, and fulfill her final request to ",
            "share the black cake when the time is right",
            "? Will their mother’s revelations bring them back together or leave them feeling more lost than ever?"
        ],
        "price": "$18.60"
    },
    {
        "id" : "6Gof205Ir6",
        "book name": "Ada Twist, Scientist (The Questioneers)",
        "link": "https://www.amazon.com/Ada-Twist-Scientist-Andrea-Beaty/dp/1419721372/ref=sr_1_42?qid=1644999099&sr=8-42&srs=17143709011",
        "author": "Andrea Beaty",
        "genre": "Children's Black & African American Story Books",
        "image": "https://images-na.ssl-images-amazon.com/images/I/61eDRm5vkiL._SX258_BO1,204,203,200_.jpg",
        "detail": [
            "Ada Twist’s head is full of questions. Like her classmates Iggy and Rosie—stars of their own New York Times bestselling picture books Iggy Peck, Architect and Rosie Revere, Engineer—Ada has always been endlessly curious. Even when her fact-finding missions and elaborate scientific experiments don’t go as planned, Ada learns the value of thinking her way through problems and continuing to stay curious."
        ],
        "price": "$4.16"
    },
    {
        "id" : "V347h-rEla",
        "book name": "Atlas of the Heart: Mapping Meaningful Connection and the Language of Human Experience",
        "link": "https://www.amazon.com/Atlas-Heart-Meaningful-Connection-Experience/dp/0399592555/ref=sr_1_9?qid=1644999016&sr=8-9&srs=17143709011",
        "author": "Brené Brown",
        "genre": "Emotional Self Help",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51KvAoff+ZL._SX407_BO1,204,203,200_.jpg",
        "detail": [
            "In Atlas of the Heart, Brown takes us on a journey through eighty-seven of the emotions and experiences that define what it means to be human. As she maps the necessary skills and an actionable framework for meaningful connection, she gives us the language and tools to access a universe of new choices and second chances—a universe where we can share and steward the stories of our bravest and most heartbreaking moments with one another in a way that builds connection."
        ],
        "price": "$18.34"
    },
    {
        "id" : "UPxIQmNgxT",
        "book name": "If Animals Kissed Good Night",
        "link": "https://www.amazon.com/If-Animals-Kissed-Good-Night/dp/0374300216/ref=sr_1_3?qid=1644999016&sr=8-3&srs=17143709011",
        "author": "Ann Whitford Paul",
        "genre": "Children's Baby Animal Books",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51PRQuO-xjL._SX258_BO1,204,203,200_.jpg",
        "detail": [
            "What if animals did what YOU do? This bestselling story imagines how animals would kiss their loved ones good night!",
            "If animals kissed good night like we do...how would they do it? Giraffe and his calf would stretch their necks high, Wolf and his pup would kiss and then HOWL, and Sloth and her baby would move sooooo sloooowwwww. And across the animal kingdom, every creature would share love in a unique way."
        ],
        "price": "$4.14"
    },
    {
        "id" : "Dm4LAJq8Ry",
        "book name": "The Seven Husbands of Evelyn Hugo: A Novel",
        "link": "https://www.amazon.com/Seven-Husbands-Evelyn-Hugo-Novel/dp/1501161938/ref=sr_1_14?qid=1644999016&sr=8-14&srs=17143709011",
        "author": "Taylor Jenkins Reid",
        "genre": "Holiday Romance (Books)",
        "image": "https://images-na.ssl-images-amazon.com/images/I/41XA5PFv3QL._SX320_BO1,204,203,200_.jpg",
        "detail": [
            "Aging and reclusive Hollywood movie icon Evelyn Hugo is finally ready to tell the truth about her glamorous and scandalous life. But when she chooses unknown magazine reporter Monique Grant for the job, no one is more astounded than Monique herself. Why her? Why now?\n\nMonique is not exactly on top of the world. Her husband has left her, and her professional life is going nowhere. Regardless of why Evelyn has selected her to write her biography, Monique is determined to use this opportunity to jumpstart her career."
        ],
        "price": "$8.49"
    },
    {
        "id" : "PzKDkMIkNf",
        "book name": "The Midnight Library: A Novel",
        "link": "https://www.amazon.com/Midnight-Library-Novel-Matt-Haig/dp/0525559477/ref=sr_1_24?qid=1644999019&sr=8-24&srs=17143709011",
        "author": "Matt Haig",
        "genre": "Time Travel Fiction",
        "image": "https://images-na.ssl-images-amazon.com/images/I/41ATfFjhelL._SX329_BO1,204,203,200_.jpg",
        "detail": [
            "Somewhere out beyond the edge of the universe there is a library that contains an infinite number of books, each one the story of another reality. One tells the story of your life as it is, along with another book for the other life you could have lived if you had made a different choice at any point in your life. While we all wonder how our lives might have been, what if you had the chance to go to the library and see for yourself? Would any of these other lives truly be better?"
        ],
        "price": "$13.29"
    },
    {
        "id" : "lsukfkMrTI",
        "book name": "Atomic Habits: An Easy & Proven Way to Build Good Habits & Break Bad Ones",
        "link": "https://www.amazon.com/Atomic-Habits-Proven-Build-Break/dp/0735211299/ref=sr_1_2?qid=1644999016&sr=8-2&srs=17143709011",
        "author": "James Clear",
        "genre": "Business Processes & Infrastructure",
        "image": "https://images-na.ssl-images-amazon.com/images/I/515mvgd0pXL._SX329_BO1,204,203,200_.jpg",
        "detail": [
            "No matter your goals, Atomic Habits offers a proven framework for improving--every day. James Clear, one of the world's leading experts on habit formation, reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviors that lead to remarkable results.\n\nIf you're having trouble changing your habits, the problem isn't you. The problem is your system. Bad habits repeat themselves again and again not because you don't want to change, but because you have the wrong system for change. You do not rise to the level of your goals. You fall to the level of your systems. Here, you'll get a proven system that can take you to new heights."
        ],
        "price": "$11.98"
    },
    {
        "id" : "UAmN7AnJiv",
        "book name": "The Fault in Our Stars",
        "link": "https://www.amazon.com/Fault-Our-Stars-John-Green/dp/014242417X/ref=sr_1_46?qid=1644999099&sr=8-46&srs=17143709011",
        "author": "John Green",
        "genre": "Teen & Young Adult Fiction about Self Esteem & Reliance",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51ED6WxFy8L._SX335_BO1,204,203,200_.jpg",
        "detail": [
            "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel’s story is about to be completely rewritten."
        ],
        "price": "$7.00"
    }
]